{
  "nodes": [
    {
      "op": "null", 
      "name": "data", 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1__weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv1_", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[0, 0, 0], [1, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv1__bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1__bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1__bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv1__bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv1__bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[2, 0, 0], [3, 0, 0], [4, 0, 0], [5, 0, 1], [6, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv1__relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[7, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[8, 0, 0], [9, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[10, 0, 0], [11, 0, 0], [12, 0, 0], [13, 0, 1], [14, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[15, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv2_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[16, 0, 0], [17, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv2_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv2_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[18, 0, 0], [19, 0, 0], [20, 0, 0], [21, 0, 1], [22, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv2_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[23, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "16", 
        "num_group": "16", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[24, 0, 0], [25, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[26, 0, 0], [27, 0, 0], [28, 0, 0], [29, 0, 1], [30, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[31, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv3_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[32, 0, 0], [33, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv3_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv3_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[34, 0, 0], [35, 0, 0], [36, 0, 0], [37, 0, 1], [38, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv3_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[39, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[40, 0, 0], [41, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[42, 0, 0], [43, 0, 0], [44, 0, 0], [45, 0, 1], [46, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv4_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[47, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv4_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[48, 0, 0], [49, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv4_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv4_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[50, 0, 0], [51, 0, 0], [52, 0, 0], [53, 0, 1], [54, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv4_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[55, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "32", 
        "num_group": "32", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[56, 0, 0], [57, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[58, 0, 0], [59, 0, 0], [60, 0, 0], [61, 0, 1], [62, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[63, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv5_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[64, 0, 0], [65, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv5_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv5_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[66, 0, 0], [67, 0, 0], [68, 0, 0], [69, 0, 1], [70, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv5_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[71, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv6_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[72, 0, 0], [73, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv6_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[74, 0, 0], [75, 0, 0], [76, 0, 0], [77, 0, 1], [78, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv6_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[79, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv6_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[80, 0, 0], [81, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv6_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv6_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv6_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[82, 0, 0], [83, 0, 0], [84, 0, 0], [85, 0, 1], [86, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv6_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[87, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv7_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "64", 
        "num_group": "64", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[88, 0, 0], [89, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv7_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[90, 0, 0], [91, 0, 0], [92, 0, 0], [93, 0, 1], [94, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv7_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[95, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv7_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[96, 0, 0], [97, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv7_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv7_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv7_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[98, 0, 0], [99, 0, 0], [100, 0, 0], [101, 0, 1], [102, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv7_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[103, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv8_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[104, 0, 0], [105, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv8_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[106, 0, 0], [107, 0, 0], [108, 0, 0], [109, 0, 1], [110, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv8_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[111, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv8_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[112, 0, 0], [113, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv8_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv8_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv8_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[114, 0, 0], [115, 0, 0], [116, 0, 0], [117, 0, 1], [118, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv8_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[119, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv9_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[120, 0, 0], [121, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv9_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[122, 0, 0], [123, 0, 0], [124, 0, 0], [125, 0, 1], [126, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv9_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[127, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv9_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[128, 0, 0], [129, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv9_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv9_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv9_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[130, 0, 0], [131, 0, 0], [132, 0, 0], [133, 0, 1], [134, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv9_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[135, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv10_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[136, 0, 0], [137, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv10_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[138, 0, 0], [139, 0, 0], [140, 0, 0], [141, 0, 1], [142, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv10_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[143, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv10_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[144, 0, 0], [145, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv10_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv10_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv10_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[146, 0, 0], [147, 0, 0], [148, 0, 0], [149, 0, 1], [150, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv10_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[151, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv11_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv11_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[152, 0, 0], [153, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv11_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv11_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[154, 0, 0], [155, 0, 0], [156, 0, 0], [157, 0, 1], [158, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv11_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[159, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv11_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv11_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[160, 0, 0], [161, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv11_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv11_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv11_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[162, 0, 0], [163, 0, 0], [164, 0, 0], [165, 0, 1], [166, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv11_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[167, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv12_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv12_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[168, 0, 0], [169, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv12_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv12_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv12_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv12_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv12_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[170, 0, 0], [171, 0, 0], [172, 0, 0], [173, 0, 1], [174, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv12_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[175, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv12_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv12_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[176, 0, 0], [177, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv12_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv12_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv12_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv12_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv12_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[178, 0, 0], [179, 0, 0], [180, 0, 0], [181, 0, 1], [182, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv12_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[183, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv13_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv13_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "128", 
        "num_group": "128", 
        "pad": "(1, 1)", 
        "stride": "(2, 2)"
      }, 
      "inputs": [[184, 0, 0], [185, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv13_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv13_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv13_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv13_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv13_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[186, 0, 0], [187, 0, 0], [188, 0, 0], [189, 0, 1], [190, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv13_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[191, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv13_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv13_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[192, 0, 0], [193, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv13_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv13_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv13_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv13_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv13_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[194, 0, 0], [195, 0, 0], [196, 0, 0], [197, 0, 1], [198, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv13_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[199, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv14_dw_weight", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv14_dw", 
      "attrs": {
        "kernel": "(3, 3)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "256", 
        "pad": "(1, 1)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[200, 0, 0], [201, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv14_dw_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv14_dw_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv14_dw_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv14_dw_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv14_dw_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[202, 0, 0], [203, 0, 0], [204, 0, 0], [205, 0, 1], [206, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv14_dw_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[207, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv14_sep_weight", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": []
    }, 
    {
      "op": "Convolution", 
      "name": "conv14_sep", 
      "attrs": {
        "kernel": "(1, 1)", 
        "no_bias": "True", 
        "num_filter": "256", 
        "num_group": "1", 
        "pad": "(0, 0)", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[208, 0, 0], [209, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "conv14_sep_bn_gamma", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv14_sep_bn_beta", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv14_sep_bn_moving_mean", 
      "attrs": {
        "__init__": "[\"zero\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "conv14_sep_bn_moving_var", 
      "attrs": {
        "__init__": "[\"one\", {}]", 
        "fix_gamma": "True"
      }, 
      "inputs": []
    }, 
    {
      "op": "BatchNorm", 
      "name": "conv14_sep_bn", 
      "attrs": {"fix_gamma": "True"}, 
      "inputs": [[210, 0, 0], [211, 0, 0], [212, 0, 0], [213, 0, 1], [214, 0, 1]]
    }, 
    {
      "op": "Activation", 
      "name": "conv14_sep_relu", 
      "attrs": {"act_type": "relu"}, 
      "inputs": [[215, 0, 0]]
    }, 
    {
      "op": "Pooling", 
      "name": "global_pool", 
      "attrs": {
        "global_pool": "True", 
        "kernel": "(7, 7)", 
        "pool_type": "avg", 
        "stride": "(1, 1)"
      }, 
      "inputs": [[216, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "fc_weight", 
      "attrs": {"num_hidden": "1000"}, 
      "inputs": []
    }, 
    {
      "op": "null", 
      "name": "fc_bias", 
      "attrs": {"num_hidden": "1000"}, 
      "inputs": []
    }, 
    {
      "op": "FullyConnected", 
      "name": "fc", 
      "attrs": {"num_hidden": "1000"}, 
      "inputs": [[217, 0, 0], [218, 0, 0], [219, 0, 0]]
    }, 
    {
      "op": "null", 
      "name": "label", 
      "inputs": []
    }, 
    {
      "op": "SoftmaxOutput", 
      "name": "cls_prob", 
      "attrs": {
        "multi_output": "True", 
        "use_ignore": "True"
      }, 
      "inputs": [[220, 0, 0], [221, 0, 0]]
    }
  ], 
  "arg_nodes": [
    0, 
    1, 
    3, 
    4, 
    5, 
    6, 
    9, 
    11, 
    12, 
    13, 
    14, 
    17, 
    19, 
    20, 
    21, 
    22, 
    25, 
    27, 
    28, 
    29, 
    30, 
    33, 
    35, 
    36, 
    37, 
    38, 
    41, 
    43, 
    44, 
    45, 
    46, 
    49, 
    51, 
    52, 
    53, 
    54, 
    57, 
    59, 
    60, 
    61, 
    62, 
    65, 
    67, 
    68, 
    69, 
    70, 
    73, 
    75, 
    76, 
    77, 
    78, 
    81, 
    83, 
    84, 
    85, 
    86, 
    89, 
    91, 
    92, 
    93, 
    94, 
    97, 
    99, 
    100, 
    101, 
    102, 
    105, 
    107, 
    108, 
    109, 
    110, 
    113, 
    115, 
    116, 
    117, 
    118, 
    121, 
    123, 
    124, 
    125, 
    126, 
    129, 
    131, 
    132, 
    133, 
    134, 
    137, 
    139, 
    140, 
    141, 
    142, 
    145, 
    147, 
    148, 
    149, 
    150, 
    153, 
    155, 
    156, 
    157, 
    158, 
    161, 
    163, 
    164, 
    165, 
    166, 
    169, 
    171, 
    172, 
    173, 
    174, 
    177, 
    179, 
    180, 
    181, 
    182, 
    185, 
    187, 
    188, 
    189, 
    190, 
    193, 
    195, 
    196, 
    197, 
    198, 
    201, 
    203, 
    204, 
    205, 
    206, 
    209, 
    211, 
    212, 
    213, 
    214, 
    218, 
    219, 
    221
  ], 
  "node_row_ptr": [
    0, 
    1, 
    2, 
    3, 
    4, 
    5, 
    6, 
    7, 
    10, 
    11, 
    12, 
    13, 
    14, 
    15, 
    16, 
    17, 
    20, 
    21, 
    22, 
    23, 
    24, 
    25, 
    26, 
    27, 
    30, 
    31, 
    32, 
    33, 
    34, 
    35, 
    36, 
    37, 
    40, 
    41, 
    42, 
    43, 
    44, 
    45, 
    46, 
    47, 
    50, 
    51, 
    52, 
    53, 
    54, 
    55, 
    56, 
    57, 
    60, 
    61, 
    62, 
    63, 
    64, 
    65, 
    66, 
    67, 
    70, 
    71, 
    72, 
    73, 
    74, 
    75, 
    76, 
    77, 
    80, 
    81, 
    82, 
    83, 
    84, 
    85, 
    86, 
    87, 
    90, 
    91, 
    92, 
    93, 
    94, 
    95, 
    96, 
    97, 
    100, 
    101, 
    102, 
    103, 
    104, 
    105, 
    106, 
    107, 
    110, 
    111, 
    112, 
    113, 
    114, 
    115, 
    116, 
    117, 
    120, 
    121, 
    122, 
    123, 
    124, 
    125, 
    126, 
    127, 
    130, 
    131, 
    132, 
    133, 
    134, 
    135, 
    136, 
    137, 
    140, 
    141, 
    142, 
    143, 
    144, 
    145, 
    146, 
    147, 
    150, 
    151, 
    152, 
    153, 
    154, 
    155, 
    156, 
    157, 
    160, 
    161, 
    162, 
    163, 
    164, 
    165, 
    166, 
    167, 
    170, 
    171, 
    172, 
    173, 
    174, 
    175, 
    176, 
    177, 
    180, 
    181, 
    182, 
    183, 
    184, 
    185, 
    186, 
    187, 
    190, 
    191, 
    192, 
    193, 
    194, 
    195, 
    196, 
    197, 
    200, 
    201, 
    202, 
    203, 
    204, 
    205, 
    206, 
    207, 
    210, 
    211, 
    212, 
    213, 
    214, 
    215, 
    216, 
    217, 
    220, 
    221, 
    222, 
    223, 
    224, 
    225, 
    226, 
    227, 
    230, 
    231, 
    232, 
    233, 
    234, 
    235, 
    236, 
    237, 
    240, 
    241, 
    242, 
    243, 
    244, 
    245, 
    246, 
    247, 
    250, 
    251, 
    252, 
    253, 
    254, 
    255, 
    256, 
    257, 
    260, 
    261, 
    262, 
    263, 
    264, 
    265, 
    266, 
    267, 
    270, 
    271, 
    272, 
    273, 
    274, 
    275, 
    276, 
    277
  ], 
  "heads": [[222, 0, 0], [221, 0, 0]], 
  "attrs": {"mxnet_version": ["int", 10200]}
}